import { getDocBySlug } from "@/lib/convertDocs";
import { HtmlRenderer } from "../lists/[slug]/HtmlRenderer";

export function generateMetadata() {
  return {
    title: "От Aвтора | Казни женщин в России ",
    description: ``,
  };
}

export default async function AboutPageNew() {
  const content = (await getDocBySlug("вступительное-слово")).data?.content
  return (
    <section className="page-container mx-auto max-w-5xl py-12 sm:py-16">
      <h1 className="text-lg mb-6">От aвтора</h1>

      <h2 className="h1 mb-10">
        Почему мы должны помнить имена женщин, расстрелянных и погибших в
        российский тюрьмах и лагерях
      </h2>

      <blockquote className="border-l-2 pl-6 mb-8" style={{ marginLeft: '40rem' }}>
        <p className="mb-4">
          “Говорят, мы мелко пашем, Оступаясь и скользя На природной почве нашей
          Глубже и пахать нельзя Мы ведь пашем на погосте, Разрыхляем верхний
          слой. Мы задеть боимся кости, Чуть прикрытые землей”
        </p>
        <p className="text-sm text-text-secondary">В.Шаламов</p>
      </blockquote>

      <div className="flex flex-col gap-4">
        <HtmlRenderer html={content!} className="[&>p]:p-2"/>
      </div>
    </section>
  );
}


// async function AboutPage() {
//   return (
//     <section className="page-container mx-auto max-w-5xl py-12 sm:py-16">
//       <h1 className="text-lg mb-6">От aвтора</h1>

//       <h2 className="h1 mb-10">
//         Почему мы должны помнить имена женщин, расстрелянных и погибших в
//         российский тюрьмах и лагерях
//       </h2>

//       <blockquote className="border-l-2 pl-6 mb-8" style={{ marginLeft: '40rem' }}>
//         <p className="mb-4">
//           “Говорят, мы мелко пашем, Оступаясь и скользя На природной почве нашей
//           Глубже и пахать нельзя Мы ведь пашем на погосте, Разрыхляем верхний
//           слой. Мы задеть боимся кости, Чуть прикрытые землей”
//         </p>
//         <p className="text-sm text-text-secondary">В.Шаламов</p>
//       </blockquote>

//       <div className="flex flex-col gap-4">
//         <p>
//           В данном проекте “Женское лицо расстрелов“…или “У расстрелов женские
//           лица “ (zhenschiny.VMN.net.)… собраны анкетные данные из формуляров (в
//           каком архивном документе или документах?) более 10 тысяч женщин. Они
//           были гражданками России и иностранками. Они представляют 35
//           национальностей. Они были приговорены к расстрелу российскими
//           карательными органами, которые официально назывались органами
//           безопасности России ЧК/ОГПУ/РВТ/РВПТ/ВЧК/ГПУ/НКВД/ВТ с 1918 по 1953
//           гг.
//         </p>
//         <p>
//           Список не полный и находится в работе. Расстрелы русских женщин
//           заканчиваются 1937 годом, в то время как расстрелы женщин нетитульных
//           наций (всех нерусских наций, привести число) происходили в советской
//           России и Советском Союзе на протяжении всего охватываемого в данном
//           исследовании периода репрессий с 1918 по 1953 годы. Кроме того,
//           архивные данные указывают на то, что национальность значительного
//           числа расстрелянным женщин неизвестна, и многие женщины были
//           приговорены к расстрелам без указания статьи обвинения, даты ареста,
//           даты приговора и даты расстрела.
//         </p>
//         <p>
//           Размышлять и говорить на тему женских казней трудно. Надо ли писать о
//           том, что мы чувствуем, или только о том, что мы думаем о тысячах
//           безвинно загубленных жизней. Я думаю, надо избегать двух крайностей:
//           праведный пафос и банальная пошлость. Но как найти верные и уместные
//           слова – по-прежнему остается задачей. Хотелось бы думать, что эти
//           списки погибших женщин помогут нам в этом.
//         </p>
//         <p>
//           Я называю эти списки окаянными. У меня даже появился ко всем спискам
//           эпиграф - строчка из стихотворения А. Кушнера (Александра?): Времена
//           не выбирают, в них живут и убивают. Женщин убивали именем советского
//           государства и во имя советского государства. Их арестовывали,
//           обыскивали, допрашивали, выносили приговор и расстреливали обличенные
//           властью – главным образом мужчины. Хотя попадались и женщины среди
//           лагерной и тюремной администрации и охраны. Осужденных женщин
//           принуждали публично клеймить членов их семей и отрекаться от них. Их
//           родные десятилетиями подвергались преследованиям, их детей помещали в
//           детские дома, зачастую меняя им фамилии. Впоследствии наиболее
//           неугомонным родственникам выдавали ложные справки о якобы их смерти в
//           лагерях.
//         </p>
//         <p>
//           Непрожитые жизни, нерожденные дети, несуществующие могилы - все звучит
//           упреком из-под земли и тьмы расстрельных ям. Далеко не все
//           реабилитированы - в каждом списке указано число реабилитированных.
//           Составлены таблицы, отражающие возраст расстрелянных. Память о
//           расстрелах невинных жертв не имеет срока давности, и мы, живущие, у
//           них в долгу. Если мы забудем о них, их не убудет, они давно вне нашей
//           досягаемости, убудет нас, беспамятных.
//         </p>
//         <p>
//           Мы должны помнить о расстрелянных и погибших в России в годы террора,
//           потому что прошлое, и особенно трагическое прошлое народа, полное боли
//           и страдания, которое сейчас власть имущие пытаются забыть, а
//           услужливые идеологи объявить несуществующим или несущественным,
//           является необходимым элементом его настоящего, если оно живое. В таком
//           настоящем живут люди, берущие на себя ответственность за происходящее
//           и пытающиеся понять его смысл. Они пытаются восстановить истинную
//           картину прошлого и сохранить ее в памяти средствами, доступными
//           культуре. Осмысляемое настоящее подвижно, оно постоянно наполняется
//           пониманием себя, оно дышит прошлым и пронизано будущим, откуда
//           приходит запрос на более полное знание себя и своего происхождения, на
//           более детальное знание прошлого. И именно такое динамичное настоящее,
//           оттененное прошлым и будущим и осознающее себя в их смысловом
//           взаимопроникновении, выступает как живая клеточка живой ткани истории.
//         </p>
//         <p>
//           При составлении списков расстрелянных женщин использовались изданные в
//           России Обществом Мемориал Мартирологи расстрелянных. Эти сведение есть
//           в интернете в открытом доступе. На Донском кладбище захоронено 5065
//           казненных, из них 227 женщин (4,5%). На Бутовском полигоне казнены 20
//           765 человек, из них 851 женщина (4,1%). Расстрельные списки Коммунарки
//           6608 казненных, из них 223 женщины (3,4%). В Москве и Московской
//           области казнено около 32000 человек, из них 774 женщины (2,4%). Всего
//           по 4-м спискам, казнено 64 438 человек, из них 2175 женщин (3,3%).
//           Другими словами, в каждой тысяче расстрелянных было 34 женщины.
//         </p>
//       </div>

//       <hr className="mt-16 mb-8" />

//       <blockquote className="text-sm  text-text-secondary">
//         <p className="mb-4">
//           ”Сначала били самых родовитых, Потом стреляли самых работящих, Потом
//           ряды бессмысленно убитых Росли из тысяч самых не молчащих. Среди
//           последних всё интеллигенты, Радетели достоинства и чести, Негодные в
//           работе инструменты, Для механизма поголовной лести. В подручных
//           поощряя бесталанность, Выискивала власть себе подобных. В
//           средневековье шла тоталитарность, Создав себе империю удобных,
//           Послушных, незаметных, молчаливых, Готовых почитать вождём
//           бездарность, Изображать воистину счастливых, По праву заслуживших
//           легендарность...Держава, обессиленная в пытках, Ещё не знала о потерях
//           сущих, Не знала, что КОЛИЧЕСТВО убитых Откликнется ей КАЧЕСТВОМ
//           живущих. Игорь Кохановский”.
//         </p>
//         <p>«Закон диалектики». 1989 г.</p>
//       </blockquote>
//     </section>
//   );
// }
